#include <stdio.h>
int main(void)
{
	int A[3][3];
	int i,j;
	for (i = 0;i < 3;i++ )
		for(j = 0;j < 3;j++)
	        scanf("%d",&A[i][j]);
	int B[9];
	int m,n,l=0;
	for (m = 0;m < 3;m++)
		for (n = 0;n < 3;n++)
			B[l++] = A[m][n];
	int s,p;
	//判断有几种解 
	s = f1(B,s);
	if(s > 1)
	 	puts("Too Many");
	if(s == 1)
	{
		f2(B);	
		for	(p = 0;p < 3;p++)
			printf("%d ",B[p]);
		printf("\n");
		for	(p = 3;p < 6;p++)
			printf("%d ",B[p]);
		printf("\n");
		for	(p = 6;p < 9;p++)
			printf("%d ",B[p]);
	} 
	return 0;
 } 
 int f1(int B[], int s)
 {
 	s = 0;
	int C[8][9] = {
	{4,9,2,3,5,7,8,1,6},
	{8,3,4,1,5,9,6,7,2},
	{6,1,8,7,5,3,2,9,4},
	{2,7,6,9,5,1,4,3,8},
	{8,1,6,3,5,7,4,9,2},
	{6,7,2,1,5,9,8,3,4},
	{2,9,4,7,5,3,6,1,8},
	{4,3,8,9,5,1,2,7,6}, 
	};
	int k,g;
	for (g = 0;g < 8;g++)
	{
		int l = 0;
		for(k = 0;k < 9;k++)
		{
			if(B[k] == 0 || B[k] == C[g][k])
				l+=1;
		}
		if(l == 9)
			s = s+1;		    
	}
	return s;//此处的返回值被赋给了f1()	
 }
 int f2(int B[])
 {
 	int C[8][9] = {
	{4,9,2,3,5,7,8,1,6},
	{8,3,4,1,5,9,6,7,2},
	{6,1,8,7,5,3,2,9,4},
	{2,7,6,9,5,1,4,3,8},
	{8,1,6,3,5,7,4,9,2},
	{6,7,2,1,5,9,8,3,4},
	{2,9,4,7,5,3,6,1,8},
	{4,3,8,9,5,1,2,7,6}, 
	};
	int k,g,m;
	for (g = 0;g < 8;g++)
	{
		int l = 0;
		for(k = 0;k < 9;k++)
		{
			if(B[k] == 0 || B[k] == C[g][k])
				l+=1;
		}
		if(l == 9)
		{
			for(m = 0;m < 9;m++)
				B[m] = C[g][m];
		}		    
	}		
 }
